# AlternateUnitsSuffix Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionType..::..AlternateUnitsSuffix Property
DimensionType Class See Also
---
The suffix text for the alternate units value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string AlternateUnitsSuffix { get; set; }
```

Visual Basic
---
```text
Public Property AlternateUnitsSuffix As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ AlternateUnitsSuffix {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
DimensionType Class
Autodesk.Revit.DB Namespace